[
    {
        "id": 1,
        "title": "NoSQL Injection",
        "severity": "High",
        "cvss": 8.1,
        "cwe": "CWE-943",
        "description": "The application fails to properly validate user input before using it in NoSQL database queries, allowing attackers to manipulate query logic and bypass security controls. This vulnerability indicates insufficient security controls in the application design and implementation, which may be abused by attackers to compromise confidentiality, integrity, or availability of the system .",
        "impact": "1. Authentication bypass is possible using crafted query operators. leading to potential account or system compromise.\n2. Sensitive data can be extracted from the database. resulting in loss of sensitive or confidential information.\n3. Database integrity may be compromised. which negatively impacts business operations and user trust.",
        "recommendation": "1. Enforce strict input validation and type checks. to reduce the immediate attack surface.\n2. Use parameterized queries or safe query builders. to ensure consistent security enforcement.\n3. Apply least privilege access to database accounts. as part of regular security hardening practices."
    },
    {
        "id": 2,
        "title": "Hardcoded Credentials in JavaScript Files",
        "severity": "High",
        "cvss": 7.4,
        "cwe": "CWE-798",
        "description": "Sensitive credentials such as API keys, tokens, or passwords are hardcoded in client-side JavaScript files, making them accessible to anyone. This vulnerability indicates insufficient security controls in the application design and implementation, which may be abused by attackers to compromise confidentiality, integrity, or availability of the system.",
        "impact": "1. Unauthorized access to backend services may occur. leading to potential account or system compromise.\n2. Third-party services can be abused. resulting in loss of sensitive or confidential information.\n3. Attackers may escalate privileges. which negatively impacts business operations and user trust.",
        "recommendation": "1. Remove credentials from client-side code. to reduce the immediate attack surface.\n2. Store secrets securely in server-side configuration. to ensure consistent security enforcement.\n3. Rotate all exposed credentials. as part of regular security hardening practices."
    },
    {
        "id": 3,
        "title": "Cookies HTTPOnly Flag Not Set",
        "severity": "Low",
        "cvss": 2.5,
        "cwe": "CWE-1004",
        "description": "Session cookies are set without the HTTPOnly attribute, allowing client-side scripts to access them. This vulnerability indicates insufficient security controls in the application design and implementation, which may be abused by attackers to compromise confidentiality, integrity, or availability of the system.",
        "impact": "1. Session cookies can be stolen via XSS. leading to potential account or system compromise.\n2. User accounts may be hijacked. resulting in loss of sensitive or confidential information.\n3. XSS impact is increased. which negatively impacts business operations and user trust.",
        "recommendation": "1. Enable HTTPOnly flag for all sensitive cookies. to reduce the immediate attack surface.\n2. Use Secure and SameSite attributes. to ensure consistent security enforcement.\n3. Audit cookie configurations regularly. as part of regular security hardening practices."
    },
    {
        "id": 4,
        "title": "Application Vulnerable to SWEET32 Attack",
        "severity": "Medium",
        "cvss": 5.8,
        "cwe": "CWE-326",
        "description": "The server supports 64-bit block ciphers such as 3DES or Blowfish, which are vulnerable to SWEET32 attacks. This vulnerability indicates insufficient security controls in the application design and implementation, which may be abused by attackers to compromise confidentiality, integrity, or availability of the system.",
        "impact": "1. Encrypted data may be partially recovered. leading to potential account or system compromise.\n2. Session cookies can be exposed. resulting in loss of sensitive or confidential information.\n3. Compliance requirements may be violated. which negatively impacts business operations and user trust.",
        "recommendation": "1. Disable 3DES and Blowfish ciphers. to reduce the immediate attack surface.\n2. Enforce AES-GCM or ChaCha20 ciphers. to ensure consistent security enforcement.\n3. Update TLS configurations. as part of regular security hardening practices."
    },
    {
        "id": 5,
        "title": "Trace Method Enabled",
        "severity": "Low",
        "cvss": 2.0,
        "cwe": "CWE-693",
        "description": "The HTTP TRACE method is enabled on the server, which can be exploited for Cross-Site Tracing attacks. This vulnerability indicates insufficient security controls in the application design and implementation, which may be abused by attackers to compromise confidentiality, integrity, or availability of the system.",
        "impact": "1. Authentication cookies can be stolen. leading to potential account or system compromise.\n2. Authorization headers may be exposed. resulting in loss of sensitive or confidential information.\n3. Attack surface is increased. which negatively impacts business operations and user trust.",
        "recommendation": "1. Disable the TRACE method. to reduce the immediate attack surface.\n2. Restrict allowed HTTP methods. to ensure consistent security enforcement.\n3. Regularly audit HTTP methods. as part of regular security hardening practices."
    },
    {
        "id": 6,
        "title": "File Upload Functionality Not Working",
        "severity": "Informational",
        "cvss": 1.0,
        "cwe": "CWE-703",
        "description": "The file upload feature is not functioning as expected, indicating a functional defect. This vulnerability indicates insufficient security controls in the application design and implementation, which may be abused by attackers to compromise confidentiality, integrity, or availability of the system.",
        "impact": "1. Business workflow is disrupted. leading to potential account or system compromise.\n2. User experience is negatively affected. resulting in loss of sensitive or confidential information.\n3. Hidden security issues may go unnoticed. which negatively impacts business operations and user trust.",
        "recommendation": "1. Fix the upload functionality. to reduce the immediate attack surface.\n2. Implement proper validation after fixing. to ensure consistent security enforcement.\n3. Perform security testing. as part of regular security hardening practices."
    },
    {
        "id": 7,
        "title": "Brute Force Attack",
        "severity": "High",
        "cvss": 8.6,
        "cwe": "CWE-307",
        "description": "The application does not restrict repeated login attempts, allowing attackers to perform brute force attacks. This vulnerability indicates insufficient security controls in the application design and implementation, which may be abused by attackers to compromise confidentiality, integrity, or availability of the system.",
        "impact": "1. User accounts can be compromised. leading to potential account or system compromise.\n2. Sensitive data may be accessed. resulting in loss of sensitive or confidential information.\n3. System trust is reduced. which negatively impacts business operations and user trust.",
        "recommendation": "1. Implement account lockout mechanisms. to reduce the immediate attack surface.\n2. Add CAPTCHA or MFA. to ensure consistent security enforcement.\n3. Monitor failed login attempts. as part of regular security hardening practices."
    },
    {
        "id": 8,
        "title": "SQL Injection",
        "severity": "Critical",
        "cvss": 9.8,
        "cwe": "CWE-89",
        "description": "User input is directly used in SQL queries without proper sanitization, allowing query manipulation. This vulnerability indicates insufficient security controls in the application design and implementation, which may be abused by attackers to compromise confidentiality, integrity, or availability of the system.",
        "impact": "1. Complete database compromise is possible. leading to potential account or system compromise.\n2. Sensitive data can be stolen. resulting in loss of sensitive or confidential information.\n3. Database integrity may be destroyed. which negatively impacts business operations and user trust.",
        "recommendation": "1. Use prepared statements. to reduce the immediate attack surface.\n2. Validate and sanitize inputs. to ensure consistent security enforcement.\n3. Apply least privilege database access. as part of regular security hardening practices."
    },
    {
        "id": 9,
        "title": "Stored Cross-Site Scripting (XSS)",
        "severity": "High",
        "cvss": 8.2,
        "cwe": "CWE-79",
        "description": "Malicious scripts are stored in the application and executed in users’ browsers. This vulnerability indicates insufficient security controls in the application design and implementation, which may be abused by attackers to compromise confidentiality, integrity, or availability of the system.",
        "impact": "1. Session hijacking is possible. leading to potential account or system compromise.\n2. User data can be stolen. resulting in loss of sensitive or confidential information.\n3. Application trust is affected. which negatively impacts business operations and user trust.",
        "recommendation": "1. Encode output properly. to reduce the immediate attack surface.\n2. Validate user input. to ensure consistent security enforcement.\n3. Implement CSP. as part of regular security hardening practices."
    },
    {
        "id": 10,
        "title": "Reflected Cross-Site Scripting (XSS)",
        "severity": "High",
        "cvss": 8.0,
        "cwe": "CWE-79",
        "description": "Malicious scripts are reflected from user input in HTTP responses. This vulnerability indicates insufficient security controls in the application design and implementation, which may be abused by attackers to compromise confidentiality, integrity, or availability of the system.",
        "impact": "1. Users can be tricked into executing scripts. leading to potential account or system compromise.\n2. Cookies may be stolen. resulting in loss of sensitive or confidential information.\n3. Phishing attacks become easier. which negatively impacts business operations and user trust.",
        "recommendation": "1. Encode reflected output. to reduce the immediate attack surface.\n2. Validate input parameters. to ensure consistent security enforcement.\n3. Use CSP headers. as part of regular security hardening practices."
    },
    {
        "id": 11,
        "title": "Stored XSS via File Upload",
        "severity": "High",
        "cvss": 8.4,
        "cwe": "CWE-79",
        "description": "Uploaded files contain malicious scripts that execute when accessed by users. This vulnerability indicates insufficient security controls in the application design and implementation, which may be abused by attackers to compromise confidentiality, integrity, or availability of the system.",
        "impact": "1. Persistent attacks affect multiple users. leading to potential account or system compromise.\n2. User sessions can be hijacked. resulting in loss of sensitive or confidential information.\n3. Reputation damage occurs. which negatively impacts business operations and user trust.",
        "recommendation": "1. Validate file content. to reduce the immediate attack surface.\n2. Restrict file types. to ensure consistent security enforcement.\n3. Serve files with safe MIME types. as part of regular security hardening practices."
    },
    {
        "id": 12,
        "title": "Application Vulnerable to Lucky13 Attack",
        "severity": "Medium",
        "cvss": 5.9,
        "cwe": "CWE-327",
        "description": "The application supports vulnerable TLS CBC cipher modes susceptible to Lucky13 attacks. This vulnerability indicates insufficient security controls in the application design and implementation, which may be abused by attackers to compromise confidentiality, integrity, or availability of the system.",
        "impact": "1. Encrypted data may be partially exposed. leading to potential account or system compromise.\n2. Session confidentiality is reduced. resulting in loss of sensitive or confidential information.\n3. Compliance risks increase. which negatively impacts business operations and user trust.",
        "recommendation": "1. Disable CBC ciphers. to reduce the immediate attack surface.\n2. Use AEAD ciphers. to ensure consistent security enforcement.\n3. Update TLS configuration. as part of regular security hardening practices."
    },
    {
        "id": 13,
        "title": "Application Vulnerable to BREACH Attack",
        "severity": "Medium",
        "cvss": 5.3,
        "cwe": "CWE-200",
        "description": "HTTP compression is enabled on sensitive responses, allowing BREACH exploitation. This vulnerability indicates insufficient security controls in the application design and implementation, which may be abused by attackers to compromise confidentiality, integrity, or availability of the system.",
        "impact": "1. Secrets in responses may be leaked. leading to potential account or system compromise.\n2. Session tokens may be exposed. resulting in loss of sensitive or confidential information.\n3. Confidentiality is reduced. which negatively impacts business operations and user trust.",
        "recommendation": "1. Disable compression for sensitive pages. to reduce the immediate attack surface.\n2. Use random padding. to ensure consistent security enforcement.\n3. Separate secrets from user input. as part of regular security hardening practices."
    },
    {
        "id": 14,
        "title": "Banner Grabbing",
        "severity": "Low",
        "cvss": 2.5,
        "cwe": "CWE-200",
        "description": "The server discloses software version information in banners. This vulnerability indicates insufficient security controls in the application design and implementation, which may be abused by attackers to compromise confidentiality, integrity, or availability of the system.",
        "impact": "1. Attackers gain reconnaissance information. leading to potential account or system compromise.\n2. Targeted attacks become easier. resulting in loss of sensitive or confidential information.\n3. System exposure increases. which negatively impacts business operations and user trust.",
        "recommendation": "1. Hide server banners. to reduce the immediate attack surface.\n2. Use generic responses. to ensure consistent security enforcement.\n3. Regularly update software. as part of regular security hardening practices."
    },
    {
        "id": 15,
        "title": "Clickjacking",
        "severity": "Low",
        "cvss": 2.9,
        "cwe": "CWE-1021",
        "description": "The application can be embedded in frames, allowing UI redressing attacks. This vulnerability indicates insufficient security controls in the application design and implementation, which may be abused by attackers to compromise confidentiality, integrity, or availability of the system.",
        "impact": "1. Users may perform unintended actions. leading to potential account or system compromise.\n2. Sensitive operations can be triggered. resulting in loss of sensitive or confidential information.\n3. Trust is reduced. which negatively impacts business operations and user trust.",
        "recommendation": "1. Use X-Frame-Options header. to reduce the immediate attack surface.\n2. Implement CSP frame-ancestors. to ensure consistent security enforcement.\n3. Test iframe protections. as part of regular security hardening practices."
    },
    {
        "id": 16,
        "title": "Missing Security Headers",
        "severity": "Low",
        "cvss": 2.9,
        "cwe": "CWE-16",
        "description": "The application does not implement recommended HTTP security headers. This vulnerability indicates insufficient security controls in the application design and implementation, which may be abused by attackers to compromise confidentiality, integrity, or availability of the system.",
        "impact": "1. Browser protections are reduced. leading to potential account or system compromise.\n2. XSS risk increases. resulting in loss of sensitive or confidential information.\n3. Clickjacking risk increases. which negatively impacts business operations and user trust.",
        "recommendation": "1. Add CSP header. to reduce the immediate attack surface.\n2. Add X-Content-Type-Options. to ensure consistent security enforcement.\n3. Add Referrer-Policy. as part of regular security hardening practices."
    },
    {
        "id": 17,
        "title": "Weak Ciphers Enabled",
        "severity": "High",
        "cvss": 8.0,
        "cwe": "CWE-326",
        "description": "The server supports outdated or weak cryptographic ciphers. This vulnerability indicates insufficient security controls in the application design and implementation, which may be abused by attackers to compromise confidentiality, integrity, or availability of the system.",
        "impact": "1. Encrypted data may be decrypted. leading to potential account or system compromise.\n2. Session confidentiality is lost. resulting in loss of sensitive or confidential information.\n3. Compliance issues arise. which negatively impacts business operations and user trust.",
        "recommendation": "1. Disable weak ciphers. to reduce the immediate attack surface.\n2. Enforce strong cipher suites. to ensure consistent security enforcement.\n3. Review TLS policies. as part of regular security hardening practices."
    },
    {
        "id": 18,
        "title": "Improper Error Handling",
        "severity": "Medium",
        "cvss": 5.6,
        "cwe": "CWE-209",
        "description": "The application reveals detailed error messages to users. This vulnerability indicates insufficient security controls in the application design and implementation, which may be abused by attackers to compromise confidentiality, integrity, or availability of the system.",
        "impact": "1. Internal logic is exposed. leading to potential account or system compromise.\n2. Attackers gain reconnaissance. resulting in loss of sensitive or confidential information.\n3. Security posture weakens. which negatively impacts business operations and user trust.",
        "recommendation": "1. Show generic errors. to reduce the immediate attack surface.\n2. Log detailed errors internally. to ensure consistent security enforcement.\n3. Disable debug mode in production. as part of regular security hardening practices."
    },
    {
        "id": 19,
        "title": "Improper Input Validation",
        "severity": "Medium",
        "cvss": 6.5,
        "cwe": "CWE-20",
        "description": "The application does not properly validate user input before processing. This vulnerability indicates insufficient security controls in the application design and implementation, which may be abused by attackers to compromise confidentiality, integrity, or availability of the system.",
        "impact": "1. Injection attacks become possible. leading to potential account or system compromise.\n2. Application logic may be bypassed. resulting in loss of sensitive or confidential information.\n3. System stability is affected. which negatively impacts business operations and user trust.",
        "recommendation": "1. Implement strict validation rules. to reduce the immediate attack surface.\n2. Use allowlist approach. to ensure consistent security enforcement.\n3. Validate on both client and server. as part of regular security hardening practices."
    },
    {
        "id": 20,
        "title": "Hardcoded API Key",
        "severity": "High",
        "cvss": 8.0,
        "cwe": "CWE-798",
        "description": "The application contains hardcoded API keys within source code or configuration files, making them accessible to anyone with access to the code or deployed client-side resources. This exposes backend or third‑party services to unauthorized use and abuse. This weakness increases the overall attack surface of the application and can be exploited remotely depending on access controls and exposure of the affected component. This vulnerability indicates insufficient security controls in the application design and implementation, which may be abused by attackers to compromise confidentiality, integrity, or availability of the system.",
        "impact": "1. Unauthorized users can access protected APIs. leading to potential account or system compromise.\n2. API usage limits or billing may be abused. resulting in loss of sensitive or confidential information.\n3. Backend services may be compromised. which negatively impacts business operations and user trust.",
        "recommendation": "1. Remove API keys from source code. to reduce the immediate attack surface.\n2. Store secrets in environment variables or secret managers. to ensure consistent security enforcement.\n3. Rotate and revoke exposed API keys. as part of regular security hardening practices."
    },
    {
        "id": 21,
        "title": "Application Vulnerable to BEAST Attack",
        "severity": "Medium",
        "cvss": 5.8,
        "cwe": "CWE-327",
        "description": "The application supports legacy TLS 1.0 encryption with CBC cipher suites, making it vulnerable to the BEAST (Browser Exploit Against SSL/TLS) attack. This attack allows an attacker to decrypt parts of encrypted traffic by exploiting weaknesses in block cipher chaining. This vulnerability indicates insufficient cryptographic hardening and weak protocol support, which may allow attackers to compromise the confidentiality of sensitive transmitted data under certain conditions.",
        "impact": "1. Encrypted session data such as cookies or tokens may be partially decrypted, leading to potential session compromise.\n2. Confidential user information transmitted over TLS can be exposed to network-based attackers.\n3. Regulatory and compliance requirements may be violated due to use of outdated cryptographic protocols.",
        "recommendation": "1. Disable TLS 1.0 and TLS 1.1 and allow only TLS 1.2 or higher to reduce cryptographic risk.\n2. Enforce use of modern AEAD cipher suites such as AES-GCM or ChaCha20-Poly1305 for secure communication.\n3. Regularly audit TLS configurations and perform vulnerability scans to ensure strong encryption standards are maintained."
    },
    {
        "id": 22,
        "title": "Cacheable HTTP Response",
        "severity": "Low",
        "cvss": 2.5,
        "cwe": "CWE-525",
        "description": "The application returns sensitive or dynamic HTTP responses with cache-control headers that allow them to be stored by browsers, proxy servers, or intermediary caching systems. As a result, confidential information such as authentication pages, account details, or session-related data may be cached and later accessed by unauthorized users. This indicates improper HTTP cache control configuration and weak response handling for sensitive resources.",
        "impact": "1. Sensitive user data may be stored in browser or proxy caches, leading to unauthorized disclosure when accessed by other users or attackers.\n2. Authentication or session-related pages may be replayed from cache, increasing the risk of session misuse or information leakage.\n3. Compliance and privacy requirements may be violated due to improper handling of confidential information.",
        "recommendation": "1. Configure appropriate cache-control headers such as Cache-Control: no-store, no-cache, must-revalidate for all sensitive responses.\n2. Use Pragma: no-cache and Expires: 0 headers to ensure backward compatibility with older clients and proxies.\n3. Review all endpoints handling sensitive data and ensure caching is explicitly disabled as part of secure response configuration."
    },
    {
        "id": 23,
        "title": "Vulnerable TLS Protocols Enabled",
        "severity": "Medium",
        "cvss": 5.9,
        "cwe": "CWE-327",
        "description": "The application supports outdated and insecure TLS/SSL protocol versions such as SSLv3, TLS 1.0, or TLS 1.1. These legacy protocols contain known cryptographic weaknesses that can be exploited by attackers to compromise encrypted communications. The presence of vulnerable TLS protocols indicates insufficient cryptographic hardening and weak transport layer security configuration.",
        "impact": "1. Encrypted network traffic may be decrypted or partially exposed by attackers performing man-in-the-middle attacks.\n2. Sensitive information such as credentials, session tokens, or personal data may be compromised during transmission.\n3. Use of insecure protocols may result in regulatory non-compliance and reduced trust in the application’s security posture.",
        "recommendation": "1. Disable all legacy protocols including SSLv2, SSLv3, TLS 1.0, and TLS 1.1 on the server.\n2. Enforce TLS 1.2 and TLS 1.3 only with strong cipher suites.\n3. Regularly review and test TLS configurations using security scanning and compliance tools."
    }
]